app/views/articles/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = $1  [["article_id", 4]]
---
  Tags:
  <% @article.tags.each do |tag| %>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 4]]
---

<h3>Comments (<%= @article.comments.size %>)</h3>