app/controllers/articles_controller.rb

    def index
        @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def show
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @article = Article.new(articles_params)
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "rtigo 4"], ["body", "ssss"], ["created_at", "2019-11-20 18:02:50.943395"], ["updated_at", "2019-11-20 18:02:50.943395"]]

    def edit
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @article = Article.find(params[:id])
        @article.update(articles_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "article 22"], ["updated_at", "2019-11-20 18:42:08.959259"], ["id", 2]]